Masmiseim36/nxpSDK/boards/twrk80f150m/project_template/pin_mux.c
/*
 * Copyright 2018-2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MK80FN256xxx15
package_id: MK80FN256VDC15
mcu_data: ksdk2_0
processor_version: 0.0.18
board: TWR-K80F150M
pin_labels:
- {pin_num: J4, pin_signal: NC147, label: NC}
- {pin_num: H6, pin_signal: NC41, label: NC}
- {pin_num: J6, pin_signal: NC146, label: NC}
- {pin_num: A11, pin_signal: NC145, label: NC}
- {pin_num: H3, pin_signal: VSS23, label: GND}
- {pin_num: F6, pin_signal: VSSA, label: GND}
- {pin_num: L6, pin_signal: VSS93, label: GND}
- {pin_num: F7, pin_signal: VSS5, label: GND}
- {pin_num: G7, pin_signal: VSS71, label: GND}
- {pin_num: K10, pin_signal: VSS57, label: GND}
- {pin_num: E5, pin_signal: VDDIO_E6, label: VDDIO_E}
- {pin_num: E6, pin_signal: VDD70, label: 'J9[2]/MCU_PWR'}
- {pin_num: E7, pin_signal: VDD94, label: 'J9[2]/MCU_PWR'}
- {pin_num: L10, pin_signal: VDD56, label: 'J9[2]/MCU_PWR'}
- {pin_num: F5, pin_signal: VDDA, label: 'J10[1]/MCU_PWR'}
- {pin_num: A1, pin_signal: PTD7/CMT_IRO/LPUART0_TX/FTM0_CH7/SDRAM_CKE/FTM0_FLT1/SPI1_SIN, label: 'J13[A56]/U2[37]/USBID/SDRAM_CKE', identifier: SDRAM_CKE;USB_ID}
- {pin_num: B1, pin_signal: PTE0/SPI1_PCS1/LPUART1_TX/SDHC0_D1/QSPI0A_DATA3/I2C1_SDA/RTC_CLKOUT, label: 'U23[7]/QSPI0A_DATA3', identifier: QSPI0A_DATA3}
- {pin_num: C2, pin_signal: PTE1/LLWU_P0/SPI1_SCK/LPUART1_RX/SDHC0_D0/QSPI0A_SCLK/I2C1_SCL/SPI1_SIN, label: 'U23[6]/QSPI0A_SCLK', identifier: QSPI0A_SCLK}
- {pin_num: C1, pin_signal: PTE2/LLWU_P1/SPI1_SOUT/LPUART1_CTS_b/SDHC0_DCLK/QSPI0A_DATA0/SPI1_SCK, label: 'U23[5]/QSPI0A_DATA0', identifier: QSPI0A_DATA0}
- {pin_num: D2, pin_signal: PTE3/SPI1_PCS2/LPUART1_RTS_b/SDHC0_CMD/QSPI0A_DATA2/SPI1_SOUT, label: 'U23[3]/QSPI0A_DATA2', identifier: QSPI0A_DATA2}
- {pin_num: D1, pin_signal: PTE4/LLWU_P2/SPI1_SIN/LPUART3_TX/SDHC0_D3/QSPI0A_DATA1, label: 'U23[2]/QSPI0A_DATA1', identifier: QSPI0A_DATA1}
- {pin_num: E2, pin_signal: PTE5/SPI1_PCS0/LPUART3_RX/SDHC0_D2/QSPI0A_SS0_B/FTM3_CH0/USB0_SOF_OUT, label: 'U23[1]/QSPI0A_SS0', identifier: QSPI0A_SS0}
- {pin_num: E1, pin_signal: PTE6/LLWU_P16/SPI1_PCS3/LPUART3_CTS_b/I2S0_MCLK/QSPI0B_DATA3/FTM3_CH1/SDHC0_D4, label: 'U22[7]/QSPI0B_DATA3', identifier: QSPI0B_DATA3}
- {pin_num: F3, pin_signal: PTE7/SPI2_SCK/LPUART3_RTS_b/I2S0_RXD0/QSPI0B_SCLK/FTM3_CH2/QSPI0A_SS1_B, label: 'U22[6]/QSPI0B_SCLK', identifier: QSPI0B_SCLK}
- {pin_num: F2, pin_signal: PTE8/I2S0_RXD1/SPI2_SOUT/I2S0_RX_FS/QSPI0B_DATA0/FTM3_CH3/SDHC0_D5, label: 'U22[5]/QSPI0B_DATA0', identifier: QSPI0B_DATA0}
- {pin_num: F1, pin_signal: PTE9/LLWU_P17/I2S0_TXD1/SPI2_PCS1/I2S0_RX_BCLK/QSPI0B_DATA2/FTM3_CH4/SDHC0_D6, label: 'U22[3]/QSPI0B_DATA2', identifier: QSPI0B_DATA2}
- {pin_num: G2, pin_signal: PTE10/LLWU_P18/I2C3_SDA/SPI2_SIN/I2S0_TXD0/QSPI0B_DATA1/FTM3_CH5/SDHC0_D7, label: 'U22[2]/QSPI0B_DATA1', identifier: QSPI0B_DATA1}
- {pin_num: G1, pin_signal: PTE11/I2C3_SCL/SPI2_PCS0/I2S0_TX_FS/QSPI0B_SS0_B/FTM3_CH6/QSPI0A_DQS, label: 'U22[1]/QSPI0B_SS0', identifier: QSPI0B_SS0}
- {pin_num: L11, pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0/TPM_CLKIN0, label: 'Y1[3]/EXTAL0', identifier: EXTAL0}
- {pin_num: K11, pin_signal: XTAL0/PTA19/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1/LPTMR1_ALT1/TPM_CLKIN1, label: 'Y1[1]/XTAL0', identifier: XTAL0}
- {pin_num: K7, pin_signal: PTA5/USB0_CLKIN/FTM0_CH2/FXIO0_D15/I2S0_TX_BCLK/JTAG_TRST_b, label: 'J13[A22]/I2S0_TX_BCLK'}
- {pin_num: J9, pin_signal: PTA10/LLWU_P22/I2C2_SDA/FTM2_CH0/EMVSIM1_VCCEN/FXIO0_D16/FTM2_QD_PHA/TPM2_CH0/TRACE_D0, label: 'J7[17]/J13[C8]/I2C2_SDA/FXIO0_D16'}
- {pin_num: H7, pin_signal: PTA11/LLWU_P23/I2C2_SCL/FTM2_CH1/FXIO0_D17/FTM2_QD_PHB/TPM2_CH1, label: 'J7[18]/J13[C7]/I2C2_SCL/FTM2_CH1//FXIO0_D17'}
- {pin_num: K8, pin_signal: PTA12/FTM1_CH0/TRACE_CLKOUT/FXIO0_D18/I2S0_TXD0/FTM1_QD_PHA/TPM1_CH0, label: 'J7[19]/J13[A25]/J13[B62]/I2S0_TXD0/FXIO0_D18'}
- {pin_num: L8, pin_signal: PTA13/LLWU_P4/FTM1_CH1/TRACE_D3/FXIO0_D19/I2S0_TX_FS/FTM1_QD_PHB/TPM1_CH1, label: 'J7[20]/J13[A23]/J13[B61]/LLWU_P4/I2S0_TX_FS/FXIO0_D19'}
- {pin_num: K9, pin_signal: PTA14/SPI0_PCS0/LPUART0_TX/TRACE_D2/FXIO0_D20/I2S0_RX_BCLK/I2S0_TXD1, label: 'J13[A42]/J13[A58]/J13[B60]/I2S0_RX_BCLK/LPUART0_TX'}
- {pin_num: L9, pin_signal: PTA15/SPI0_SCK/LPUART0_RX/TRACE_D1/FXIO0_D21/I2S0_RXD0, label: 'J13[A24]/J13[A41]/I2S0_RXD0/LPUART0_RX'}
- {pin_num: J10, pin_signal: PTA16/SPI0_SOUT/LPUART0_CTS_b/TRACE_D0/FXIO0_D22/I2S0_RX_FS/I2S0_RXD1, label: 'J13[A59]/I2S0_RX_FS'}
- {pin_num: H10, pin_signal: PTA17/SPI0_SIN/LPUART0_RTS_b/FXIO0_D23/I2S0_MCLK, label: 'J13[A21]/I2S0_MCLK'}
- {pin_num: H5, pin_signal: PTA20/I2C0_SCL/LPUART4_TX/FTM_CLKIN1/FXIO0_D8/EWM_OUT_b/TPM_CLKIN1, label: 'J7[9]/J13[C40]/FXIO0_D8/EWM_OUT'}
- {pin_num: J5, pin_signal: PTA21/LLWU_P21/I2C0_SDA/LPUART4_RX/FXIO0_D9/EWM_IN, label: 'J7[10]/J13[C39]/SW3/FXIO0_D9/LLWU_P21/EWM_IN', identifier: SW3}
- {pin_num: H11, pin_signal: PTA29/FB_A24, label: 'Q1[3]/USB_PWROUT', identifier: USB_PWR_STAT}
- {pin_num: L7, pin_signal: TSI0_CH1/PTA0/LPUART0_CTS_b/FTM0_CH5/FXIO0_D10/EMVSIM0_CLK/JTAG_TCLK/SWD_CLK, label: 'J7[11]/J11[4]/U13[4]/JTAG_TCLK/SWD_CLKCH5/FXIO0_D10'}
- {pin_num: H8, pin_signal: TSI0_CH2/PTA1/LPUART0_RX/FTM0_CH6/I2C3_SDA/FXIO0_D11/EMVSIM0_IO/JTAG_TDI, label: 'J7[12]/J11[8]/JTAG_TDI/FXIO0_D11'}
- {pin_num: J7, pin_signal: TSI0_CH3/PTA2/LPUART0_TX/FTM0_CH7/I2C3_SCL/FXIO0_D12/EMVSIM0_PD/JTAG_TDO/TRACE_SWO, label: 'J7[13]/J11[6]/JTAG_TDO/TRACE_SWO/FXIO0_D12'}
- {pin_num: H9, pin_signal: TSI0_CH4/PTA3/LPUART0_RTS_b/FTM0_CH0/FXIO0_D13/EMVSIM0_RST/JTAG_TMS/SWD_DIO, label: 'J11[2]/U11[4]/U25[2]/JTAG_TMS/SWD_DIO'}
- {pin_num: J8, pin_signal: TSI0_CH5/PTA4/LLWU_P3/FTM0_CH1/FXIO0_D14/EMVSIM0_VCCEN/NMI_b, label: 'J12[4]/SW2/NMI/TSI0_CH5', identifier: SW2}
- {pin_num: L4, pin_signal: XTAL32, label: 'Y2[1]/XTAL32', identifier: XTAL32K}
- {pin_num: L5, pin_signal: EXTAL32, label: 'Y2[2]/EXTAL32', identifier: EXTAL32K}
- {pin_num: G11, pin_signal: ADC0_SE8/TSI0_CH0/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/SDRAM_CAS_b/FTM1_QD_PHA/TPM1_CH0/FXIO0_D0, label: 'J7[1]/J12[5]/U2[17]/J13[A38]/FXIO0_D0/FTM1_CH0/SDRAM_CAS/TSI0_CH0',
  identifier: SDRAM_CAS}
- {pin_num: G10, pin_signal: ADC0_SE9/TSI0_CH6/PTB1/I2C0_SDA/FTM1_CH1/SDRAM_RAS_b/FTM1_QD_PHB/TPM1_CH1/FXIO0_D1, label: 'J7[2]/J12[7]/U2[18]/J13[A28]/J13[A37]/FXIO0_D1/FTM1_CH1/SDRAM_RAS/TSI0_CH6',
  identifier: SDRAM_RAS}
- {pin_num: G9, pin_signal: ADC0_SE12/TSI0_CH7/PTB2/I2C0_SCL/LPUART0_RTS_b/SDRAM_WE/FTM0_FLT3/FXIO0_D2, label: 'J7[3]/J12[8]/U2[16]/FXIO0_D2/SDRAM_WE/TSI0_CH7', identifier: SDRAM_WE}
- {pin_num: G8, pin_signal: ADC0_SE13/TSI0_CH8/PTB3/I2C0_SDA/LPUART0_CTS_b/SDRAM_CS0_b/FTM0_FLT0/FXIO0_D3, label: 'J7[4]/J12[9]/U2[19]/FXIO0_D3/SDRAM_CS0/TSI0_CH8',
  identifier: SDRAM_CS0}
- {pin_num: B11, pin_signal: PTB4/EMVSIM1_IO/SDRAM_CS1_b/FTM1_FLT0, label: 'J13[C61]/J35[C7]/EMVSIM1_IO', identifier: SMARTCARD_IO}
- {pin_num: C11, pin_signal: PTB5/EMVSIM1_CLK/FTM2_FLT0, label: 'J13[B59]/J13[C58]/J35[C3]/EMVSIM1_CLK', identifier: SMARTCARD_CLK}
- {pin_num: F11, pin_signal: PTB6/EMVSIM1_VCCEN/FB_AD23/SDRAM_D23, label: 'J13[C25]/U7[B2]/U2[13]/EMVSIM1_VCCEN/SDRAM_D23', identifier: SMARTCARD_VCCEN;SDRAM_D23}
- {pin_num: E11, pin_signal: PTB7/EMVSIM1_PD/FB_AD22/SDRAM_D22, label: 'J13[C22]/J35[SW1]/U2[11]/EMVSIM1_PD/SDRAM_D22', identifier: SMARTCARD_PD;SDRAM_D22}
- {pin_num: D11, pin_signal: PTB8/EMVSIM1_RST/LPUART3_RTS_b/FB_AD21/SDRAM_D21, label: 'J13[C59]/J35[C2]/U2[10]/EMVSIM1_RST/SDRAM_D21', identifier: SMARTCARD_RST;SDRAM_D21}
- {pin_num: E10, pin_signal: PTB9/SPI1_PCS1/LPUART3_CTS_b/FB_AD20/SDRAM_D20, label: 'J13[B58]/U2[8]/SDRAM_D20', identifier: SDRAM_D20}
- {pin_num: D10, pin_signal: PTB10/SPI1_PCS0/LPUART3_RX/I2C2_SCL/FB_AD19/SDRAM_D19/FTM0_FLT1/FXIO0_D4, label: 'J7[5]/J13[B57]/J13[B70]/U2[7]/FBa_AD19/SDRAM_D19/FXIO0_D4',
  identifier: SDRAM_D19}
- {pin_num: C10, pin_signal: PTB11/SPI1_SCK/LPUART3_TX/I2C2_SDA/FB_AD18/SDRAM_D18/FTM0_FLT2/FXIO0_D5, label: 'J7[6]/J13[B69]/U2[5]/FBa_AD18/SDRAM_D18/FXIO0_D5', identifier: SDRAM_D18}
- {pin_num: B10, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/LPUART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0, label: 'J12[10]/J13[B68]/U2[4]/D4[1]/TSI0_CH9/FBa_AD17/SDRAM_D17/BRD_PAD2',
  identifier: TSI_ELECTRODE_1;SDRAM_D17}
- {pin_num: E9, pin_signal: TSI0_CH10/PTB17/SPI1_SIN/LPUART0_TX/FTM_CLKIN1/FB_AD16/SDRAM_D16/EWM_OUT_b/TPM_CLKIN1, label: 'J12[11]/J13[B67]/U2[2]/D13[1]/TSI0_CH10/FBa_AD16/SDRAM_D16/BRD_PAD1',
  identifier: TSI_ELECTRODE_2;SDRAM_D16}
- {pin_num: D9, pin_signal: TSI0_CH11/PTB18/FTM2_CH0/I2S0_TX_BCLK/FB_AD15/SDRAM_A23/FTM2_QD_PHA/TPM2_CH0/FXIO0_D6, label: 'J7[7]/J12[12]/J13[A34]/J13[B66]/TSI0_CH11/FBa_AD15/SDRAM_A23/FXIO0_D6/FTM2_CH0',
  identifier: SDRAM_A23}
- {pin_num: C9, pin_signal: TSI0_CH12/PTB19/FTM2_CH1/I2S0_TX_FS/FB_OE_b/FTM2_QD_PHB/TPM2_CH1/FXIO0_D7, label: 'J7[8]/J12[13]/J13[A33]/J13[B72]/TSI0_CH12/FBa_OE/FXIO0_D7/FTM2_CH1'}
- {pin_num: F10, pin_signal: PTB20/SPI2_PCS0/FB_AD31/SDRAM_D31/CMP0_OUT/FXIO0_D8, label: 'J13[B73]/U2[53]/FBa_AD31/SDRAM_D31', identifier: SDRAM_D31}
- {pin_num: F9, pin_signal: PTB21/SPI2_SCK/FB_AD30/SDRAM_D30/CMP1_OUT/FXIO0_D9, label: 'J13[B74]/U2[51]/FBa_AD30/SDRAM_D30', identifier: SDRAM_D30}
- {pin_num: F8, pin_signal: PTB22/SPI2_SOUT/FB_AD29/SDRAM_D29/FXIO0_D10, label: 'J13[B75]/U2[50]/FBa_AD29/SDRAM_D29', identifier: SDRAM_D29}
- {pin_num: E8, pin_signal: PTB23/SPI2_SIN/SPI0_PCS5/FB_AD28/SDRAM_D28/FXIO0_D11, label: 'J13[B76]/U2[48]/FBa_AD28/SDRAM_D28', identifier: SDRAM_D28}
- {pin_num: D8, pin_signal: ADC0_SE15/TSI0_CH14/PTC1/LLWU_P6/SPI0_PCS3/LPUART1_RTS_b/FTM0_CH0/FB_AD13/SDRAM_A21/I2S0_TXD0/FXIO0_D13, label: 'J7[14]/J12[15]/J13[A40]/J13[A67]/J13[B21]/U2[20]/FBa_AD13/SDRAM_A21/FXIO0_D13/TSI0_CH14',
  identifier: SDRAM_A21}
- {pin_num: B9, pin_signal: ADC0_SE14/TSI0_CH13/PTC0/SPI0_PCS4/PDB0_EXTRG/USB0_SOF_OUT/FB_AD14/SDRAM_A22/I2S0_TXD1/FXIO0_D12, label: 'J12[14]/J13[A66]/U2[21]/FBa_AD14/SDRAM_A22/TSI0_CH13',
  identifier: SDRAM_A22}
- {pin_num: C8, pin_signal: ADC0_SE4b/CMP1_IN0/TSI0_CH15/PTC2/SPI0_PCS2/LPUART1_CTS_b/FTM0_CH1/FB_AD12/SDRAM_A20/I2S0_TX_FS, label: 'J12[16]/J13[A9]/J13[A39]/J13[A68]/U2[35]/FBa_AD12/SDRAM_A20/TSI0_CH15',
  identifier: SDRAM_A20}
- {pin_num: C7, pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB0_EXTRG/I2S0_RX_BCLK/FB_AD9/SDRAM_A17/I2S0_MCLK/FXIO0_D14, label: 'J7[15]/J13[A71]/J13[B45]/U2[33]/SPI0_SOUT/FXIO0_D14/FBa_AD9/SDRAM_A17',
  identifier: SDRAM_A17}
- {pin_num: B7, pin_signal: CMP0_IN1/PTC7/SPI0_SIN/USB0_SOF_OUT/I2S0_RX_FS/FB_AD8/SDRAM_A16/FXIO0_D15, label: 'J7[16]/J13[A72]/J13[B44]/U2[23]/SPI0_SIN/FBa_AD8/SDRAM_A16/FXIO0_D15',
  identifier: SDRAM_A16}
- {pin_num: A7, pin_signal: CMP0_IN2/PTC8/FTM3_CH4/I2S0_MCLK/FB_AD7/SDRAM_A15/FXIO0_D16, label: 'J13[A73]/U2[24]/FBa_AD7/SDRAM_A15', identifier: SDRAM_A15}
- {pin_num: D6, pin_signal: CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/SDRAM_A14/FTM2_FLT0/FXIO0_D17, label: 'J13[A74]/U2[25]/FBa_AD6/SDRAM_A14', identifier: SDRAM_A14}
- {pin_num: B8, pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/LPUART1_RX/FTM0_CH2/CLKOUT/I2S0_TX_BCLK, label: 'J6[2]/LPUART1_RX/CLKOUT', identifier: SDRAM_CLK;DEBUG_UART_RX}
- {pin_num: A8, pin_signal: PTC4/LLWU_P8/SPI0_PCS0/LPUART1_TX/FTM0_CH3/FB_AD11/SDRAM_A19/CMP1_OUT, label: 'J8[2]/J13[A69]/U2[22]/LPUART1_TX/FBa_AD11/SDRAM_A19', identifier: SDRAM_A19;DEBUG_UART_TX}
- {pin_num: D7, pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/LPTMR1_ALT2/I2S0_RXD0/FB_AD10/SDRAM_A18/CMP0_OUT/FTM0_CH2, label: 'J13[A70]/U2[34]/FBa_AD10/SDRAM_A18',
  identifier: SDRAM_A18}
- {pin_num: C6, pin_signal: PTC10/I2C1_SCL/FTM3_CH6/I2S0_RX_FS/FB_AD5/SDRAM_A13/FXIO0_D18, label: 'J13[A75]/J13[B50]/U2[26]/I2C1_SCL/FBa_AD5/SDRAM_A13', identifier: SDRAM_A13}
- {pin_num: C5, pin_signal: PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/I2S0_RXD1/FB_RW_b/FXIO0_D19, label: 'J13[B51]/J13[B71]/I2C1_SDA/FBa_RW'}
- {pin_num: B6, pin_signal: PTC12/LPUART4_RTS_b/FTM_CLKIN0/FB_AD27/SDRAM_D27/FTM3_FLT0/TPM_CLKIN0, label: 'J13[B77]/U2[47]/FBa_AD27/SDRAM_D27', identifier: SDRAM_D27}
- {pin_num: A6, pin_signal: PTC13/LPUART4_CTS_b/FTM_CLKIN1/FB_AD26/SDRAM_D26/TPM_CLKIN1, label: 'J13[B78]/U2[45]/FBa_AD26/SDRAM_D26', identifier: SDRAM_D26}
- {pin_num: A5, pin_signal: PTC14/LPUART4_RX/FB_AD25/SDRAM_D25/FXIO0_D20, label: 'J13[B79]/U2[44]/FBa_AD25/SDRAM_D25', identifier: SDRAM_D25}
- {pin_num: B5, pin_signal: PTC15/LPUART4_TX/FB_AD24/SDRAM_D24/FXIO0_D21, label: 'J13[B80]/U2[42]/FBa_AD24/SDRAM_D24', identifier: SDRAM_D24}
- {pin_num: D5, pin_signal: PTC16/LPUART3_RX/FB_CS5_b/FB_TSIZ1/FB_BE23_16_BLS15_8_b/SDRAM_DQM2, label: 'U2[15]/SDRAM_DQM2', identifier: SDRAM_DQM2}
- {pin_num: C4, pin_signal: PTC17/LPUART3_TX/FB_CS4_b/FB_TSIZ0/FB_BE31_24_BLS7_0_b/SDRAM_DQM3, label: 'J1[8]/U2[39]/SDRAM_DQM3', identifier: SDRAM_DQM3}
- {pin_num: B4, pin_signal: PTC18/LPUART3_RTS_b/FB_TBST_b/FB_CS2_b/FB_BE15_8_BLS23_16_b/SDRAM_DQM1, label: 'J18[2]/U5[4]/K80_USB_FLGA', identifier: USB_FLAG}
- {pin_num: A4, pin_signal: PTC19/LPUART3_CTS_b/FB_CS3_b/FB_BE7_0_BLS31_24_b/SDRAM_DQM0/FB_TA_b, label: 'J28[2]/U5[3]/K80_USB_EN', identifier: USB_PWR_EN}
- {pin_num: D4, pin_signal: PTD0/LLWU_P12/SPI0_PCS0/LPUART2_RTS_b/FTM3_CH0/FB_ALE/FB_CS1_b/FB_TS_b/FXIO0_D22, label: 'J13[B48]/J13[B63]/SPI0_PCS0/FBa_ALE/FBa_CS1'}
- {pin_num: D3, pin_signal: ADC0_SE5b/PTD1/SPI0_SCK/LPUART2_CTS_b/FTM3_CH1/FB_CS0_b/FXIO0_D23, label: 'J13[B46]/J13[B64]/SPI0_SCK/FBa_CS0'}
- {pin_num: C3, pin_signal: PTD2/LLWU_P13/SPI0_SOUT/LPUART2_RX/FTM3_CH2/FB_AD4/SDRAM_A12/I2C0_SCL, label: 'J13[A76]/J13[B35]/U2[29]/FBa_AD4/SDRAM_A12', identifier: SDRAM_A12}
- {pin_num: B3, pin_signal: PTD3/SPI0_SIN/LPUART2_TX/FTM3_CH3/FB_AD3/SDRAM_A11/I2C0_SDA, label: 'J13[A77]/J13[B52]/U2[30]/FBa_AD3/SDRAM_A11', identifier: SDRAM_A11}
- {pin_num: A3, pin_signal: PTD4/LLWU_P14/SPI0_PCS1/LPUART0_RTS_b/FTM0_CH4/FB_AD2/SDRAM_A10/EWM_IN/SPI1_PCS0, label: 'J13[A78]/J13[B47]/U2[31]/FBa_AD2/SDRAM_A10',
  identifier: SDRAM_A10}
- {pin_num: A2, pin_signal: ADC0_SE6b/PTD5/SPI0_PCS2/LPUART0_CTS_b/FTM0_CH5/FB_AD1/SDRAM_A9/EWM_OUT_b/SPI1_SCK, label: 'J13[A27]/J13[A79]/U2[32]/FBa_AD1/SDRAM_A9',
  identifier: SDRAM_A9}
- {pin_num: B2, pin_signal: ADC0_SE7b/PTD6/LLWU_P15/SPI0_PCS3/LPUART0_RX/FTM0_CH6/FB_AD0/FTM0_FLT0/SPI1_SOUT, label: 'J13[A11]/J13[A80]/J13[B52]/U2[30]/FBa_AD0'}
- {pin_num: A10, pin_signal: PTD8/LLWU_P24/I2C0_SCL/FB_A16/FXIO0_D24, label: 'J13[A7]/U1[11]/U3[8]/U26[4]/I2C0_SCL', identifier: ACCEL_SCL;GYRO_SCL;PRESSURE_SCL}
- {pin_num: A9, pin_signal: PTD9/I2C0_SDA/FB_A17/FXIO0_D25, label: 'J13[A8]/U1[12]/U3[7]/U26[6]/I2C0_SDA', identifier: ACCEL_SDA;GYRO_SDA;PRESSURE_SDA}
- {pin_num: E3, pin_signal: PTD11/LLWU_P25/SPI2_PCS0/FB_A19/FXIO0_D27, label: D1/LED_J_PTD11, identifier: LED_RED}
- {pin_num: E4, pin_signal: PTD10/FB_A18/FXIO0_D26, label: 'Q4[1]/CHG_EN'}
- {pin_num: F4, pin_signal: PTD12/SPI2_SCK/FTM3_FLT0/FB_A20/FXIO0_D28, label: D2/LED_J_PTD12, identifier: LED_GREEN}
- {pin_num: G3, pin_signal: PTD13/SPI2_SOUT/FB_A21/FXIO0_D29, label: D3/LED_J_PTD13, identifier: LED_BLUE}
- {pin_num: G4, pin_signal: PTD14/SPI2_SIN/FB_A22/FXIO0_D30, label: D13/TP_LED1RR, identifier: LED_TSI_PAD2}
- {pin_num: H4, pin_signal: PTD15/SPI2_PCS1/FB_A23/FXIO0_D31, label: D14/TP_LED2RR, identifier: LED_TSI_PAD1}
- {pin_num: K1, pin_signal: ADC0_DM0, label: 'J12[18]/TWRPI_ID1'}
- {pin_num: L1, pin_signal: ADC0_DM1, label: 'J13[A29]'}
- {pin_num: K3, pin_signal: ADC0_DM3, label: 'R44[2]/POT_5K/ADC0_DM3', identifier: ADC_POT}
- {pin_num: K2, pin_signal: ADC0_DP0, label: 'J12[17]/TWRPI_ID0'}
- {pin_num: L2, pin_signal: ADC0_DP1, label: 'J13[A30]'}
- {pin_num: J3, pin_signal: ADC0_DP3, label: R272/R276/BAT_OUT/ADC0_DP3}
- {pin_num: K4, pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23, label: 'J13[A32]'}
- {pin_num: H1, pin_signal: USB0_DM, label: 'U9[2]/K80_USB0_DM', identifier: USB_DM}
- {pin_num: H2, pin_signal: USB0_DP, label: 'U9[1]/K80_USB0_DP', identifier: USB_DP}
- {pin_num: J1, pin_signal: VOUT33, label: 'J25[2]/P3V3_K80_VOUT', identifier: USB_VOUT}
- {pin_num: J2, pin_signal: VREGIN, label: 'J22[2]/5V0_VREGIN_K80', identifier: USB_VREGIN}
- {pin_num: L3, pin_signal: VREF_OUT/CMP1_IN5/CMP0_IN5/ADC0_SE22, label: TP20/VREF_OUT}
- {pin_num: G5, pin_signal: VREFH, label: VREFH}
- {pin_num: G6, pin_signal: VREFL, label: GND}
- {pin_num: K5, pin_signal: RTC_WAKEUP_B, label: RTC_WAKEUP}
- {pin_num: K6, pin_signal: VBAT, label: 'J3[2]/VBAT'}
- {pin_num: J11, pin_signal: RESET_b, label: 'J11[10]/J12[20]/J13[A62]/U24[7]/RESET'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

